Revit 2024 API
CentralModelContentionException Class
The exception thrown when a central model is busy (locked) and the operation is canceled.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
[SerializableAttribute]
public class CentralModelContentionException : CentralModelException
Visual Basic
<SerializableAttribute> _
Public Class CentralModelContentionException _
	Inherits CentralModelException
Visual C++
[SerializableAttribute]
public ref class CentralModelContentionException : public CentralModelException
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.CentralModelException
 Autodesk.Revit.Exceptions.CentralModelContentionException
See Also
CentralModelContentionException Members
Autodesk.Revit.Exceptions Namespace